Revit 2026 API

# PrintParametersZoomType Property

---

The zoom type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ZoomType ZoomType { get; set; }
```
```vb
Public Property ZoomType As ZoomType
	Get
	Set
```
```cpp
public:
property ZoomType ZoomType {
	ZoomType get ();
	void set (ZoomType value);
}
```
```fsharp
member ZoomType : ZoomType with get, set
```

#### Property Value

ZoomType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the input argument is out of range. |

#### Reference

PrintParameters Class

Autodesk.Revit.DB Namespace